/**
 *
 * Да се направи функција која за даден број на чекори `n` и низа од вредности, ќе ги поместува елементите кои се наоѓаат во неа следејќи ги следните правила:
 *
 * - Доколку `n` е ПОЗИТИВЕН број, тогаш секој од елементите во низата треба да ја промени својата позиција кон десно, за онолку места колку што изнесува `n`.
 *
 * - Доколку `n` е НЕГАТИВЕН број, тогаш секој од елементите во низата треба да ја промени својата позиција кон лево, за онолку места колку што изнесува `n`.
 *
 * Пример:
 *  - n = 2, низата ['1', '2', '3'] треба да се претвори во ['2', '3', '1']
 *  - n = -3, низата ['1', '2', '3', '4', '5'] треба да се претвори во ['4', '5', '1', '2', '3']
 * 
 
 */


 let array = ['1','2','3','4','5'];
 n=-3;
 function rotate (array, n){
     if (n<0){
 for(i=0; i>n; i--){
     array.push(array.shift());
 }
     }
     else 
     for (i=0; i<n; i++){
     array.unshift(array.pop());
     }
     return array;
 }
 console.log(rotate(array,n));